export const icons = [...new Array(4)].map((_, i) => `user-icons/pet_${i}.jpg`);

export const titles = [
  'Катя',
  'Центр особых животных',
  'Друг - Иван',
  'Начальник - работа',
];

export const phrases = [
  'Друзья, у меня для вас особенный выпуск новостей!',
  'Круто!',
  'И Human Interface Guidelines и Material Design рекомендуют',
  'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь',
  'В 2008 году художник Jon Rafman  начал собирать пивные банки. '
    + 'Теперь он готов представить миру свой новый артхаус-шедевр.',
  'Так увлёкся работой по курсу, что совсем забыл его анонсировать',
  'Можно или сегодня или завтра вечером.',
  'К вечеру понедельника жду ТЗ у себя на почте',
];
