export const icons = [...new Array(4)].map((item, i) => `user-icons/pet_${i}.jpg`);

export const titles = [
  'Катя',
  'Центр особых животных',
  'Друг - Иван',
  'Начальник - работа',
];

export const phrases = [
  'Друзья, у меня для вас особенный выпуск новостей!',
  'Круто!',
  'И Human Interface Guidelines и Material Design рекомендуют',
  'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь',
  'В 2008 году художник Jon Rafman  начал собирать пивные банки. '
    + 'Теперь он готов представить миру свой новый артхаус-шедевр.',
  'Так увлёкся работой по курсу, что совсем забыл его анонсировать',
  'Можно или сегодня или завтра вечером.',
  'К вечеру понедельника жду ТЗ у себя на почте',
];

/* eslint-disable */
// I use preGenerator to create preGeneratedStaticData file and then just copy it`s content manually to this constant
export const preGeneratedChatsData = [{
  id: 'chat-list-item-0',
  icon: 'user-icons/pet_1.jpg',
  title: 'Друг - Иван',
  unreadedMessages: [],
  unread: 0,
  readedMessages: [{ text: 'Круто!', time: '2022-09-29T00:31:27.000Z' }, { text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-29T00:31:27.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-29T00:31:27.000Z' }, { text: 'Друзья, у меня для вас особенный выпуск новостей!', time: '2022-09-29T00:31:27.000Z' }, { text: 'К вечеру понедельника жду ТЗ у себя на почте', time: '2022-09-29T00:31:27.000Z' }, { text: 'Можно или сегодня или завтра вечером.', time: '2022-09-29T00:31:27.000Z' }, { text: 'Так увлёкся работой по курсу, что совсем забыл его анонсировать', time: '2022-09-29T00:31:27.000Z' }, { text: 'И Human Interface Guidelines и Material Design рекомендуют', time: '2022-09-29T00:31:27.000Z' }],
}, {
  id: 'chat-list-item-1',
  icon: 'user-icons/pet_2.jpg',
  title: 'Катя',
  unreadedMessages: [{ text: 'Так увлёкся работой по курсу, что совсем забыл его анонсировать', time: '2022-09-30T13:14:34.000Z' }, { text: 'Друзья, у меня для вас особенный выпуск новостей!', time: '2022-09-30T13:14:34.000Z' }, { text: 'К вечеру понедельника жду ТЗ у себя на почте', time: '2022-09-30T13:14:34.000Z' }, { text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-30T13:14:34.000Z' }, { text: 'Можно или сегодня или завтра вечером.', time: '2022-09-30T13:14:34.000Z' }], unread: 5, readedMessages: [{ text: 'К вечеру понедельника жду ТЗ у себя на почте', time: '2022-09-30T08:32:51.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-30T08:32:51.000Z' }, { text: 'Круто!', time: '2022-09-30T08:32:51.000Z' }],
}, {
  id: 'chat-list-item-2',
  icon: 'user-icons/pet_4.jpg',
  title: 'Начальник - работа',
  unreadedMessages: [{ text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-30T08:42:24.000Z' }, { text: 'Можно или сегодня или завтра вечером.', time: '2022-09-30T08:42:24.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-30T08:42:24.000Z' }, { text: 'Круто!', time: '2022-09-30T08:42:24.000Z' }, { text: 'Друзья, у меня для вас особенный выпуск новостей!', time: '2022-09-30T08:42:24.000Z' }], unread: 5, readedMessages: [{ text: 'К вечеру понедельника жду ТЗ у себя на почте', time: '2022-09-28T18:36:06.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-28T18:36:06.000Z' }, { text: 'Друзья, у меня для вас особенный выпуск новостей!', time: '2022-09-28T18:36:06.000Z' }],
}, {
  id: 'chat-list-item-3',
  icon: 'user-icons/pet_1.jpg',
  title: 'Центр особых животных',
  unreadedMessages: [{ text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-29T18:20:33.000Z' }, { text: 'Круто!', time: '2022-09-29T18:20:33.000Z' }], unread: 2, readedMessages: [{ text: 'Можно или сегодня или завтра вечером.', time: '2022-09-29T04:03:58.000Z' }, { text: 'И Human Interface Guidelines и Material Design рекомендуют', time: '2022-09-29T04:03:58.000Z' }, { text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-29T04:03:58.000Z' }, { text: 'К вечеру понедельника жду ТЗ у себя на почте', time: '2022-09-29T04:03:58.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-29T04:03:58.000Z' }, { text: 'Так увлёкся работой по курсу, что совсем забыл его анонсировать', time: '2022-09-29T04:03:58.000Z' }],
}, {
  id: 'chat-list-item-4',
  icon: 'user-icons/pet_1.jpg',
  title: 'Друг - Иван',
  unreadedMessages: [{ text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-29T04:22:28.000Z' }, { text: 'И Human Interface Guidelines и Material Design рекомендуют', time: '2022-09-29T04:22:28.000Z' }, { text: 'Круто!', time: '2022-09-29T04:22:28.000Z' }], unread: 3, readedMessages: [{ text: 'Миллионы россиян ежедневно проводят 8+ часов во сне. Россияне проснитесь', time: '2022-09-29T15:07:48.000Z' }, { text: 'Друзья, у меня для вас особенный выпуск новостей!', time: '2022-09-29T15:07:48.000Z' }, { text: 'И Human Interface Guidelines и Material Design рекомендуют', time: '2022-09-29T15:07:48.000Z' }, { text: 'Так увлёкся работой по курсу, что совсем забыл его анонсировать', time: '2022-09-29T15:07:48.000Z' }, { text: 'В 2008 году художник Jon Rafman  начал собирать пивные банки. Теперь он готов представить миру свой новый артхаус-шедевр.', time: '2022-09-29T15:07:48.000Z' }],
}];

/* eslint-enable */
